# SET_INDEX

In [41]:
import pandas as pd


df = pd.DataFrame({
    'ID': [101, 102, 103],
    'Nome': ['Ana', 'Bruno', 'Carlos'],
    'Idade': [25, 30, 22]
})

print("DataFrame original:")
display(df)


df_indexed = df.set_index('ID')
print("\nDataFrame com 'ID' como índice:")
display(df_indexed)


# keys: Nome(s) da(s) coluna(s) a serem usadas como índice.
# drop=True: Remove a coluna original do DataFrame (se False, mantém a coluna original).
# append=False: Se True, adiciona o novo índice sem remover o atual.
# inplace=False: Se True, altera o DataFrame original sem precisar reatribuir.

DataFrame original:

    ID    Nome  Idade
0  101     Ana     25
1  102   Bruno     30
2  103  Carlos     22

DataFrame com 'ID' como índice:

       Nome  Idade
ID
101     Ana     25
102   Bruno     30
103  Carlos     22

In [43]:
df_multi = df.set_index(['ID', 'Nome'])
display(df_multi)

            Idade
ID  Nome
101 Ana        25
102 Bruno      30
103 Carlos     22

# RESET_INDEX

In [37]:

df_reset = df_indexed.reset_index(drop = False)

print("\nDataFrame após reset_index():")
print(df_reset)

# DROP --> FALSE : devolve o indice ao dataframe como uma coluna , TRUE : joga a coluna (ex indice) fora

DataFrame após reset_index():
    ID    Nome  Idade
0  101     Ana     25
1  102   Bruno     30
2  103  Carlos     22